

if __name__ == "__main__":
    print("Возможные процедуры:")
    print(" 1 - вывести список файлов в текущей директории")
    print(" 2 - вывести информацию о системе")
    print(" 3 - вывести список процессов")
    print(" 4 - продублировать все фйлы в теукщей директории")
    print(" 5 - продубировать указанный файл")
    print(" 6 - удалить все дубликаты файлов")
    proc_num = input("выберите нужную процедуру: ")

    ans = input("Продолжаем работу?: ")

    print("Информация о системе: ")
    print("Количество процессоров: ")
    print("Платформа: ")
    print("Кодировка файловой системы: ")
    print("Текущая директория: ")
    print("Текущий пользователь: ")

    print("Список запущенных процессов: ")

    print("=Дублирование файлов в текущей директории=")
    print("Файл", ..., "был успешно создан")

    print("=Дублирование указанного файла=")
    file_name = input("Укажите имя файла: ")
    print("Файл", ..., "был успешно создан")

    directory = input("Укажите имя директории: ")
    print("Файл", ..., "был успешно удален")
